//===========================================================================================================================================================
// 
// 車のベース処理 [car.cpp]
// Author : souma umeda
// 
//===========================================================================================================================================================
#include "car.h"

//========================================================================================================================
// コンストラクタ
//========================================================================================================================
CCar::CCar()
{
	// パラメーターの設定

	m_Param.fWeight = MAX_WEIGHT;
	m_Param.nMaxGear = MAX_GEAR;
	m_Param.fBending = MAX_BENDING;
	m_Param.nMaxLife = MAX_LIFE;

	for (int i = 0; i < m_Param.nMaxGear; i++)
	{
		m_Param.fMaxSpeed[i] = MAX_SPEED[i];
	}

	m_type = CParamStorage::CAR_NORMAL;

	m_fOldSpeed = 0.0f;
	m_Action = NONE;

	m_CurrParam.nGear = 0;
	m_CurrParam.Speed = 0.0f;
	m_CurrParam.nLife = 100;
}

//========================================================================================================================
// デストラクタ
//========================================================================================================================
CCar::~CCar()
{
}

//========================================================================================================================
// 初期設定
//========================================================================================================================
HRESULT CCar::Init()
{
	InitType();

	CActor::Init();

	return S_OK;
}

//========================================================================================================================
// 終了処理
//========================================================================================================================
void CCar::Uninit()
{
	CActor::Uninit();
}

//========================================================================================================================
// 更新処理
//========================================================================================================================
void CCar::Update()
{
	if (m_CurrParam.Speed<=0.0f)
	{
		m_Action = NONE;
	}

	D3DXVECTOR3 pos = GetPos();		// 位置
	D3DXVECTOR3 move = GetMove();	// 移動値
	D3DXVECTOR3 rot = GetRot();		// 向き

	// 表示上のスピード設定
	ViewSetting();
	
	// 速度が過去の速度より上がっていなかったら
	if (m_fOldSpeed >= m_CurrParam.Speed)
	{// だんだん減速する
		move.x += -1 * ( move.x * 0.01f);
		move.z += -1 * ( move.z * 0.01f);
	}

	// 位置を設定
	pos.y += move.y;
	pos.x += sinf(GetRot().y) * move.x;
	pos.z += cosf(GetRot().y) * move.z;
	SetPos(pos);


	// 移動値を保存
	m_oldmove = move;

	// 移動値を設定
	SetMove(move);

	CActor::Update();
}

//========================================================================================================================
// 描画処理
//========================================================================================================================
void CCar::Draw()
{
	CActor::Draw();
}

//===========================================================================================================
// タイプごとの初期設定
//===========================================================================================================
void CCar::InitType()
{
	switch (m_type)
	{
	case CParamStorage::CAR_NORMAL:

		SetModel("data\\model\\car_normal_000.x");	// モデルを設定

		break;

	case CParamStorage::CAR_TRACK:

		break;

	case CParamStorage::CAR_SPORTS:

		SetModel("data\\model\\car_sample.x");	// モデルを設定

		break;

	default:
		break;
	}
}

//===========================================================================================================
// 表示上のスピード設定
//===========================================================================================================
void CCar::ViewSetting()
{
	D3DXVECTOR3 move = GetMove();
	D3DXVECTOR3 copymove = GetMove();				// 移動値のコピー
	D3DXVECTOR3 normalize = { 1.0f,1.0f,1.0f };		// 正規化の変数


	// 表示上の数値を整数にする
	if (move.x < 0.0f)
	{
		normalize.x = -1;
	}
	if (move.z < 0.0f)
	{
		normalize.z = -1;
	}

	copymove.x = copymove.x * normalize.x;
	copymove.z = copymove.z * normalize.z;

	// 見た目のスピード
	m_CurrParam.Speed = sqrtf(copymove.x * copymove.x + copymove.z * copymove.z);

	// 表示上のスピードを保存
	m_fOldSpeed = m_CurrParam.Speed;
}

//===========================================================================================================
// アクセル処理
//===========================================================================================================
void CCar::ActionAccele()
{
	D3DXVECTOR3 move = GetMove();

	if (m_CurrParam.Speed < m_Param.fMaxSpeed[m_CurrParam.nGear])
	{
		move.x += m_Param.fMaxSpeed[0] * 0.025f;
		move.z += m_Param.fMaxSpeed[0] * 0.025f;
	}

	SetMove({ move.x,0.0f,move.z });

	m_Action = ACCELE;
}

//===========================================================================================================
// ブレーキ処理
//===========================================================================================================
void CCar::ActionBrake()
{
	D3DXVECTOR3 move = GetMove();

	if (m_CurrParam.Speed < m_Param.fMaxSpeed[m_CurrParam.nGear] * 0.5f)
	{
		move.x += m_Param.fMaxSpeed[0] *-0.0125f;
		move.z += m_Param.fMaxSpeed[0] *-0.0125f;
	}

	m_CurrParam.Speed += -0.1f;

	SetMove({ move.x,0.0f,move.z });

	m_Action = BRAKE;
}

//===========================================================================================================
// カーブ処理
//===========================================================================================================
float CCar::ActionBend()
{
	float fAddRot = 0.0f;	// 加える回転量

	switch (m_Action)
	{// 車のスピードと乗算することによって速度が落ちたときに曲がれないようにする
	case ACCELE:
		fAddRot += 0.005f * m_CurrParam.Speed;
		break;

	case BRAKE:
		fAddRot += -0.005f * m_CurrParam.Speed;
		break;

	default:
		break;
	}

	// 回転しすぎないように制御
	if (fAddRot > m_Param.fBending)
	{
		fAddRot = m_Param.fBending;
	}
	else if (fAddRot < -m_Param.fBending)
	{
		fAddRot = -m_Param.fBending;
	}

	return fAddRot;
}

//===========================================================================================================
// カーブ処理　右
//===========================================================================================================
void CCar::ActionBend_R()
{	
	D3DXVECTOR3 rot = GetRot();
	float fAddRot = 0.0f;	// 加える回転量

	// 加算する回転量を取得
	fAddRot = ActionBend();

	// ここで車に加える
	rot.y += fAddRot;

	SetRot(rot);
}

//===========================================================================================================
// カーブ処理　左
//===========================================================================================================
void CCar::ActionBend_L()
{
	D3DXVECTOR3 rot = GetRot();
	float fAddRot = 0.0f;	// 加える回転量

	// 加算する回転量を取得
	fAddRot = ActionBend();
	// 反対方向にする
	fAddRot *= -1;

	// ここで車に加える
	rot.y += fAddRot;

	SetRot(rot);
}

//===========================================================================================================
// ブースト処理
//===========================================================================================================
void CCar::ActionBoost()
{
}

//========================================================================================================================
// 生成処理
//========================================================================================================================
CCar* CCar::Create()
{
	CCar* pCar = new CCar;

	pCar->Init();

	return pCar;
}