//===========================================================================================================================================================
// 
// プレイヤーの操作制御 [player_controller.cpp]
// Author : souma umeda
// 
//===========================================================================================================================================================
#include "player_controller.h"
#include "manager.h"

//===========================================================================================================
// コンストラクタ
//===========================================================================================================
CPlayerController::CPlayerController()
{
}

//===========================================================================================================
// デストラクタ
//===========================================================================================================
CPlayerController::~CPlayerController()
{
}

//===========================================================================================================
// 初期設定
//===========================================================================================================
void CPlayerController::Init()
{
}

//===========================================================================================================
// 終了処理
//===========================================================================================================
void CPlayerController::Uninit()
{
}

//===========================================================================================================
// 更新処理
//===========================================================================================================
void CPlayerController::Update(CCarPlayer* pCar)
{
	CInputKeyBoard* keyboard = CManager::GetKeyboard();
	CInputJoypad* joypad = CManager::GetJoypad();

	if (pCar != nullptr)
	{
		if (keyboard->GetPress(DIK_W))
		{
			pCar->ActionAccele();
		}
		
		else if (keyboard->GetPress(DIK_S))
		{
			pCar->ActionBrake();
		}

		if (keyboard->GetPress(DIK_D))
		{
			pCar->ActionBend_R();
		}

		else if (keyboard->GetPress(DIK_A))
		{
			pCar->ActionBend_L();
		}

#ifdef _DEBUG

		// ギア変更
		if (keyboard->GetTrigger(DIK_UPARROW))
		{
			if (pCar->GetGear() < pCar->GetGearNum() - 1)
			{
				pCar->SetGear(pCar->GetGear() + 1);
			}
		}
		else if (keyboard->GetTrigger(DIK_DOWNARROW))
		{
			if (pCar->GetGear() > 0)
			{
				pCar->SetGear(pCar->GetGear() - 1);
			}
		}
#endif // DEBUG

		
	}

}

void CPlayerController::Move()
{
}

